using System;
/*
 * Даны целые положительные числа A и B (A < B). Вывести все целые числа от A до B включительно; каждое число должно выводиться на новой строке;
 * при этом каждое число должно выводиться количество раз, равное его значению (например, число 3 выводится 3 раза). 
 * Например: если А = 3, а В = 7, то программа должна сформировать в консоли следующий вывод: 3 3 3 4 4 4 4 5 5 5 5 5 6 6 6 6 6 6 7 7 7 7 7 7 7
 */
namespace task_3
{
    class Program
    {
        public static void Main(string[] args)
        {
            int A, B;
            Console.WriteLine("Enter a range of values between A and B: ");
            while (true)
            {
                A = int.Parse(Console.ReadLine());
                B = int.Parse(Console.ReadLine());
                if ((A > 0 && B > 0) && A < B)
                    break;
                else
                    Console.WriteLine("Incorrect value. Try again.");
            }

            for (int i = A; i <= B; i++)
            {
                for (int j = 0; j < i; j++)
                {
                    Console.Write(i);
                }
                Console.Write(Environment.NewLine);
            }

        }
    }
}

/*
 * Даны целые положительные числа A, B, C. Значение этих чисел программа должна запрашивать у пользователя. 
 * На прямоугольнике размера A*B размещено максимально возможное количество квадратов со стороной C. Квадраты не накладываются друг на друга. 
 * Найти количество квадратов, размещенных на прямоугольнике, а также площадь незанятой части прямоугольника. 
 * Необходимо предусмотреть служебные сообщения в случае, если в прямоугольнике нельзя разместить ни одного квадрата со стороной С (например, если значение С превышает размер сторон прямоугольника).

Начальный вклад в банке равен 10000 руб. Через каждый месяц размер вклада увеличивается на P процентов от имеющейся суммы (P — вещественное число, 0 < P < 25).
Значение Р программа должна получать у пользователя. 
По данному P определить через сколько месяцев размер вклада превысит 11000 руб., и вывести найденное количество месяцев K (целое число) и итоговый размер вклада S (вещественное число).

Даны целые положительные числа A и B (A < B). Вывести все целые числа от A до B включительно; каждое число должно выводиться на новой строке;
при этом каждое число должно выводиться количество раз, равное его значению (например, число 3 выводится 3 раза). 
Например: если А = 3, а В = 7, то программа должна сформировать в консоли следующий вывод: 3 3 3 4 4 4 4 5 5 5 5 5 6 6 6 6 6 6 7 7 7 7 7 7 7

Описать структуру Article, содержащую следующие поля: код товара; название товара; цену товара.

Описать структуру Client содержащую поля: код клиента; ФИО; адрес; телефон; количество заказов осуществленных клиентом; общая сумма заказов клиента.

Описать структуру RequestItem содержащую поля: товар; количество единиц товара.

Описать структуру Request содержащую поля: код заказа; клиент; дата заказа; перечень заказанных товаров; сумма заказа (реализовать вычисляемым свойством).

Описать перечисление ArticleType определяющее типы товаров, и добавить соответствующее поле в структуру Article.

Описать перечисление ClientType определяющее важность клиента, и добавить соответствующее поле в структуру Client.

Описать перечисление PayType определяющее форму оплаты клиентом заказа, и добавить соответствующее поле в структуру Request.
*/
